import React, { useState } from 'react'
import Image from 'next/image'


import lodka from '../../assets/img/lodkaJSN.svg'
import { KaterBack, KaterPlus } from '../../assets/svg/svg'
import BoxKater from './BoxKater'
import styles from '../Kater/kater.module.scss'
import KaterDescribe from './KaterDescribe'
import TransDescribe from './TransDescribe'
import HelmDescribe from './HelmDescribe'
import MotorsDescribe from './MotorsDescribe'
import RadarDescribe from './RadarDescribe'
import { useSelector } from 'react-redux'



const Katers = [
    {
        id: 1,
        title: 'Катера для прогулки и рыбалки',
        image: '/imgs/openkater.png',
        moreImg:"/imgs/kaen.png",
        name: 'Троллинговый мотор ',
        description: 'Созданы для того, чтобы приносить людям радость, комфорт и удовлетворение, когда они находятся на воде. Троллинговый мотор, применяется рыбаками на катерах для ловли методом троллинга, то есть на движущуюся приманку или наживку. Троллинговый мотор — это своего рода электронный якорь, который удержит катер на заданных координатах по GPS. Мотор избавит Вас от физического поднимания и отпускания якоря лебёдкой или вручную.',
        name1: 'Картплоттер /МФД ',
        description1: 'Картплоттер/МФД — это незаменимый друг на воде, с помощью встроенного эхолота он отображает глубину, помогает ориентироваться на воде с помощью встроенного GPS модуля. Современные картплоттеры имеют встроенные WIFI и Bluetooth модули. В картплоттеры можно загружать профессиональные   навигационные карты С- MAP, NAVIONICS, GARMIN, MaxSea, которые помогут ориентироваться на воде. К картплоттеру можно подключить РЛС (радиолокационную станцию, гидравлический, тросовый автопилот, троллинговый мотор, тепловизор, морскую радиостанцию, АИС, датчик скорости ветра, датчик скорости, Сонары с 3D отображением, в режиме реального времени, вперёд смотрящий датчик, вывести данные двигателя и др. оборудование.',
        name2: 'Отопитель',
        description2: 'с помощью мультисенсорного дисплея, вы можете выбирать наиболее важную информацию о судне с любого устройства на борту, подключенного к NMEA 2000®. К ним относятся число оборотов в минуту, скорость относительно земли, скорость ветра, скорость относительно воды, уровень топлива, триммер, давление масла, количество моточасов, расход топлива, экономия топлива и температура.  Может работать, как автономный приборный дисплей и контроллер автопилота на борту небольших судов.',
        name3: 'Транцевые плиты ',
        description3: 'с помощью мультисенсорного дисплея, вы можете выбирать наиболее важную информацию о судне с любого устройства на борту, подключенного к NMEA 2000®. К ним относятся число оборотов в минуту, скорость относительно земли, скорость ветра, скорость относительно воды, уровень топлива, триммер, давление масла, количество моточасов, расход топлива, экономия топлива и температура.  Может работать, как автономный приборный дисплей и контроллер автопилота на борту небольших судов.',
        name4: ' Датчик эхолота ',
        description4: 'с помощью встроенного эхолота он отображает глубину, помогает ориентироваться на воде с помощью встроенного GPS модуля. Современные картплоттеры имеют встроенные WIFI и Bluetooth модули. В картплоттеры можно загружать профессиональные   навигационные карты С- MAP, NAVIONICS, GARMIN, MaxSea, которые помогут ориентироваться на воде. К картплоттеру можно подключить РЛС (радиолокационную станцию, гидравлический, тросовый автопилот, троллинговый мотор, тепловизор, морскую радиостанцию, АИС, датчик скорости ветра, датчик скорости, Сонары с 3D отображением, в режиме реального времени, вперёд смотрящий датчик, вывести данные двигателя и др. оборудование.',
        name5: 'Подвесной бензиновый мотор ',
        description5: 'Созданы для того, чтобы приносить людям  радость, комфорт и удовлетворение , когда они находятся на воде. Скорость  на воде за неё отвечает двигатель, который разгонит Ваш катер  до 80/100 км/ч. Скорость на воде ощущается совершенно по другому. Современные двигатели бывают 2-х тактные и 4-х тактные. 4-х тактные более экономичны и мощнее. Мощность двигателя у некоторых моделей может доходить до 450 л.с.',
    },

    {
        id: 2,
        title: 'Кабинный катер для дальних поездок',
        moreImg:"/imgs/zakryt.png",
        image: '/imgs/closedkater.png',
        name: 'МДФ картплоттер ',
        description: 'Картплоттер/МФД — это незаменимый друг на воде, с помощью встроенного эхолота он отображает глубину, помогает ориентироваться на воде с помощью встроенного GPS модуля. Современные картплоттеры имеют встроенные WIFI и Bluetooth модули. В картплоттеры можно загружать профессиональные   навигационные карты С- MAP, NAVIONICS, GARMIN, MaxSea, которые помогут ориентироваться на воде. К картплоттеру можно подключить РЛС (радиолокационную станцию, гидравлический, тросовый автопилот, троллинговый мотор, тепловизор, морскую радиостанцию, АИС, датчик скорости ветра, датчик скорости, Сонары с 3D отображением, в режиме реального времени, вперёд смотрящий датчик, вывести данные двигателя и др. оборудование.',
        name1: 'РЛС радар',
        description1: 'Радиолокационная станция помогает судоводителю ориентироваться на воде в тёмное время суток, когда видимость менее 1 км, когда туман или сильный дождь. РЛС отображает все объекты, которые находятся в зоне видимости РЛС на поверхности воды- например топляк, плавучее бревно, буй, торчащее из воды дерево и др. РЛС помогает определить кратчайшее расстояние до цели, а также помогает предотвратить столкновение с другими объектами путём их отслеживания до сближения по MARPA. Современные РЛС закрытого типа не используют магнетрон, следовательно у них очень низкое излучение, которое позволяет использовать РЛС на стоянках в маринах.',
        name2: 'Автопилот',
        description2: 'Автопилот – предназначен для районов плавания, на акваториях, где нет поворотов и извилистых участков. Обычно автопилоты применяют на океанах, морях, больших озёрах, водохранилищах. Судоводитель задаёт курс автопилоту и судно идёт по заданному курсу. Судоводитель в это время может заниматься своими делами, не нужно держать штурвал руками. Автопилот, не сможет обойти препятствие если оно появится еа заданном курсе, поэтому судоводитель всегда должен это понимать не отходить на долго от штурвала. Автопилот удачное решение для комфортного пребывания на воде.',
        name3: ' Интерцепторы',
        description3: 'с помощью мультисенсорного дисплея, вы можете выбирать наиболее важную информацию о судне с любого устройства на борту, подключенного к NMEA 2000®. К ним относятся число оборотов в минуту, скорость относительно земли, скорость ветра, скорость относительно воды, уровень топлива, триммер, давление масла, количество моточасов, расход топлива, экономия топлива и температура.  Может работать, как автономный приборный дисплей и контроллер автопилота на борту небольших судов.',
        name4: ' Система кондиционирования.',
        description4: 'Преобразователи, трандьюсеры это незаменимый помощник любому судоводителю, датчики отображают глубину, температуру, скорость относительно воды, рельеф и структуру дна в проекциях 2D и 3D, а также сетевые преобразователи, которые работают по сети NMEA 2000. Технологии развиваются и сейчас появились трандьюсеры в режиме реального времени, Вы можете видеть, что происходит под водой с помощью систем Live Scope™, PANOTIX, ACTIV TARGET.  Для безопасного подхода к незнакомым участкам во избежание попадания судна на мель применяют вперёдсмотрящие датчики FORWARD SCAN.  Датчики –делятся на категории: врезные в корпус, вклеиваемые, транцевые устанавливаются на транец судна.  По материалу преобразователи бывают пластиковые, бронзовые, нержавеющая сталь.',
        name5: 'Подвесной бензиновый мотор.',
        description5: 'Созданы для того, чтобы приносить людям  радость, комфорт и удовлетворение , когда они находятся на воде. Скорость  на воде за неё отвечает двигатель, который разгонит Ваш катер  до 80/100 км/ч. Скорость на воде ощущается совершенно по другому. Современные двигатели бывают 2-х тактные и 4-х тактные. 4-х тактные более экономичны и мощнее. Мощность двигателя у некоторых моделей может доходить до 450 л.с.',
    },

    {
        id: 3,
        title: 'Парусные яхта для путешествий',
        moreImg:"/imgs/sorasnba.png",
        image: '/imgs/paruskater.png',
        name: 'МФД картплоттер',
        description: 'Картплоттер/МФД — это незаменимый друг на воде, с помощью встроенного эхолота он отображает глубину, помогает ориентироваться на воде с помощью встроенного GPS модуля. Современные картплоттеры имеют встроенные WIFI и Bluetooth модули. В картплоттеры можно загружать профессиональные   навигационные карты С- MAP, NAVIONICS, GARMIN, MaxSea, которые помогут ориентироваться на воде. К картплоттеру можно подключить РЛС (радиолокационную станцию, гидравлический, тросовый автопилот, троллинговый мотор, тепловизор, морскую радиостанцию, АИС, датчик скорости ветра, датчик скорости, Сонары с 3D отображением, в режиме реального времени, вперёд смотрящий датчик, вывести данные двигателя и др. оборудование.',
        name1: 'Цифровой индикаторный дисплей ',
        description1: 'с помощью мультисенсорного дисплея, вы можете выбирать наиболее важную информацию о судне с любого устройства на борту, подключенного к NMEA 2000®. К ним относятся число оборотов в минуту, скорость относительно земли, скорость ветра, скорость относительно воды, уровень топлива, триммер, давление масла, количество моточасов, расход топлива, экономия топлива и температура.  Может работать, как автономный приборный дисплей и контроллер автопилота на борту небольших судов.',
        name2: 'Румпельный автопилот ',
        description2: 'Автопилот – предназначен для районов плавания, на акваториях, где нет поворотов и извилистых участков. Обычно автопилоты применяют на океанах, морях, больших озёрах, водохранилищах. Судоводитель задаёт курс автопилоту и судно идёт по заданному курсу. Судоводитель в это время может заниматься своими делами, не нужно держать штурвал руками. Автопилот, не сможет обойти препятствие если оно появится еа заданном курсе, поэтому судоводитель всегда должен это понимать не отходить на долго от штурвала. Автопилот удачное решение для комфортного пребывания на воде.',
        name3: 'Датчик эхолота ',
        description3: 'с помощью встроенного эхолота он отображает глубину, помогает ориентироваться на воде с помощью встроенного GPS модуля. Современные картплоттеры имеют встроенные WIFI и Bluetooth модули. В картплоттеры можно загружать профессиональные   навигационные карты С- MAP, NAVIONICS, GARMIN, MaxSea, которые помогут ориентироваться на воде. К картплоттеру можно подключить РЛС (радиолокационную станцию, гидравлический, тросовый автопилот, троллинговый мотор, тепловизор, морскую радиостанцию, АИС, датчик скорости ветра, датчик скорости, Сонары с 3D отображением, в режиме реального времени, вперёд смотрящий датчик, вывести данные двигателя и др. оборудование.',
        name4: 'Датчик скорости ветра',
        description4: 'с помощью мультисенсорного дисплея, вы можете выбирать наиболее важную информацию о судне с любого устройства на борту, подключенного к NMEA 2000®. К ним относятся число оборотов в минуту, скорость относительно земли, скорость ветра, скорость относительно воды, уровень топлива, триммер, давление масла, количество моточасов, расход топлива, экономия топлива и температура.  Может работать, как автономный приборный дисплей и контроллер автопилота на борту небольших судов.',

    },

    {
        id: 4,
        moreImg:"/imgs/lodkaJSN.svg",
        title: 'Яхты премиум класса',
        image: '/imgs/yaxtpremium.png',
        name: 'МФД / картплоттер ',
        description: 'Картплоттер/МФД — это незаменимый друг на воде, с помощью встроенного эхолота он отображает глубину, помогает ориентироваться на воде с помощью встроенного GPS модуля. Современные картплоттеры имеют встроенные WIFI и Bluetooth модули. В картплоттеры можно загружать профессиональные   навигационные карты С- MAP, NAVIONICS, GARMIN, MaxSea, которые помогут ориентироваться на воде. К картплоттеру можно подключить РЛС (радиолокационную станцию, гидравлический, тросовый автопилот, троллинговый мотор, тепловизор, морскую радиостанцию, АИС, датчик скорости ветра, датчик скорости, Сонары с 3D отображением, в режиме реального времени, вперёд смотрящий датчик, вывести данные двигателя и др. оборудование.',
        name1: 'РЛС/радар ',
        description1: 'Радиолокационная станция помогает судоводителю ориентироваться на воде в тёмное время суток, когда видимость менее 1 км, когда туман или сильный дождь. РЛС отображает все объекты, которые находятся в зоне видимости РЛС на поверхности воды- например топляк, плавучее бревно, буй, торчащее из воды дерево и др. РЛС помогает определить кратчайшее расстояние до цели, а также помогает предотвратить столкновение с другими объектами путём их отслеживания до сближения по MARPA. Современные РЛС закрытого типа не используют магнетрон, следовательно у них очень низкое излучение, которое позволяет использовать РЛС на стоянках в маринах.',
        name2: 'Успокоитель качки',
        description2: 'Объединить оборудование в одну навигационную систему помогают сетевые кабеля, переходники, удлинители, разветвители, хабы, тройники, терминаторы.',
        name3: 'Система кондиционирования ',
        description3: 'Преобразователи, трандьюсеры это незаменимый помощник любому судоводителю, датчики отображают глубину, температуру, скорость относительно воды, рельеф и структуру дна в проекциях 2D и 3D, а также сетевые преобразователи, которые работают по сети NMEA 2000. Технологии развиваются и сейчас появились трандьюсеры в режиме реального времени, Вы можете видеть, что происходит под водой с помощью систем Live Scope™, PANOTIX, ACTIV TARGET.  Для безопасного подхода к незнакомым участкам во избежание попадания судна на мель применяют вперёдсмотрящие датчики FORWARD SCAN.  Датчики –делятся на категории: врезные в корпус, вклеиваемые, транцевые устанавливаются на транец судна.  По материалу преобразователи бывают пластиковые, бронзовые, нержавеющая сталь.',
        name4: ' Телескокпический кран балка/трап/платформа ',
        description4: 'Объединить оборудование в одну навигационную систему помогают сетевые кабеля, переходники, удлинители, разветвители, хабы, тройники, терминаторы.',
        name5: 'Датчик эхолота.  ',
        description5: 'с помощью встроенного эхолота он отображает глубину, помогает ориентироваться на воде с помощью встроенного GPS модуля. Современные картплоттеры имеют встроенные WIFI и Bluetooth модули. В картплоттеры можно загружать профессиональные   навигационные карты С- MAP, NAVIONICS, GARMIN, MaxSea, которые помогут ориентироваться на воде. К картплоттеру можно подключить РЛС (радиолокационную станцию, гидравлический, тросовый автопилот, троллинговый мотор, тепловизор, морскую радиостанцию, АИС, датчик скорости ветра, датчик скорости, Сонары с 3D отображением, в режиме реального времени, вперёд смотрящий датчик, вывести данные двигателя и др. оборудование.',
        name6: 'Судовой дизель генератор.',
        name7: ' Опреснительная установка.',
    }
]



const Kater = () => {


    const [activeKater, setActiveKater] = useState(false)
    const [activeRadar, setActiveRadar] = useState(false)
    const [activeTrans, setActiveTrans] = useState(false)
    const [activeHelm, setActiveHelm] = useState(false)
    const [activeRadarer, setActiveRadarer] = useState(false)
    const [activeMotor, setActiveMotor] = useState(false)

    const bestler = useSelector((state) => state.bestlerSlice.currentBestler)

    console.log(bestler);
    return (
        <div className={styles.Kater}>
            <div className={activeKater ? styles.kater__inner_active : styles.kater__inner}>
                <div className={activeKater? styles.kater__title_active : styles.kater__title}>
                    <p>Оборудование, которое можно установить на катера</p>
                </div>

                {
                    activeKater ?
                        <>
                            <div className={styles.about__kater__detail}>
                                <div className={styles.toBack__icon__kater} onClick={() => setActiveKater(false)}>
                                    <KaterBack />
                                </div>
                                <div className={styles.about__detail__kater__stadii1}>
                                    <div className={styles.kater__detail} onClick={() => setActiveHelm(true)}>
                                        <div className={styles.kater__kotakbas}>
                                            {bestler.name}
                                        </div>
                                        <KaterPlus />
                                    </div>
                                    <div className={styles.kater__detail1} onClick={() => setActiveRadarer(true)}>
                                        <KaterPlus />
                                        <div className={styles.kater__kotakbas}>
                                            {bestler.name1.substr(0,20)}
                                        </div>
                                    </div>
                                    <div className={styles.interegation__modal}>
                                        <div className={styles.kater__detail} onClick={() => setActiveRadar(true)}>
                                            <KaterPlus />
                                            <div className={styles.kater__kotakbas}>
                                                {bestler.name2}
                                            </div>
                                        </div>
                                    </div>
                                </div>

                                <div className={styles.about__detail__kater__stadii2} >
                                    <div className={styles.kater__detail}>
                                        <div className={styles.kater__kotakbas}>
                                            {bestler.name3.substr(0,20)}
                                        </div>
                                        <KaterPlus />
                                    </div>
                                </div>

                                <div className={styles.about__detail__kater__stadii3}>
                                    <div className={styles.kater__detail} onClick={() => setActiveMotor(true)}>
                                        <div className={styles.kater__kotakbas}>
                                            {bestler.name4.substr(0,15)}
                                        </div>
                                        <KaterPlus />
                                    </div>
                                    <div className={styles.kater__detail} onClick={() => setActiveTrans(true)}>
                                        {
                                            bestler.name5?.length > 0 ?
                                                <>
                                                    <KaterPlus />
                                                    <div className={styles.kater__kotakbas}>
                                                        {bestler.name5.substr(0,20)}
                                                    </div>
                                                </>
                                                :
                                                ''

                                        }

                                    </div>
                                </div>
                            </div>
                            <div className={styles.kater__about__lodka}>
                                <img src={bestler.moreImg} alt=""/>
                            </div>
                            <div className={styles.toBack__icon__kater_ac} onClick={() => setActiveKater(false)}>
                                <button><KaterBack/> Выбор катеров и яхт</button>
                                </div>
                            <KaterDescribe kater={bestler} active={activeRadar} setActive={setActiveRadar} />
                            <TransDescribe kater={bestler} active={activeTrans} setActive={setActiveTrans} />
                            <HelmDescribe kater={bestler} active={activeHelm} setActive={setActiveHelm} />
                            <RadarDescribe kater={bestler} active={activeRadarer} setActive={setActiveRadarer} />
                            <MotorsDescribe kater={bestler} active={activeMotor} setActive={setActiveMotor} />
                        </>


                        :

                        <div className={styles.kater__names}>
                            <div className={styles.kater__first}>
                                {
                                    Katers.map((kater) => <BoxKater kater={kater} id={kater.id} activeKater={activeKater} setActiveKater={setActiveKater} />)

                                }

                            </div>
                        </div>

                }



            </div>
        </div>
    )
}

export default Kater
